CS400W2x6LESarray/motorBike/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0     0)
    (65.30 0     0)
    (65.30 18.48 0)
    (0     18.48 0)
    (0     0     37.27)
    (65.30 0     37.27)
    (65.30 18.48 37.27)
    (0     18.48 37.27)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 5 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
